app/controllers/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)

    if @pin.save
---
INSERT INTO "pins" ("is_public", "longitude", "latitude", "created_at", "updated_at", "social_login") VALUES (?, ?, ?, ?, ?, ?)  [["is_public", true], ["longitude", 40.4173], ["latitude", 82.9071], ["created_at", 2017-01-14 04:04:50 UTC], ["updated_at", 2017-01-14 04:04:50 UTC], ["social_login", 1]]